-- phpMyAdmin SQL Dump
-- version 4.9.4
-- https://www.phpmyadmin.net/
--
-- Servidor: localhost:3306
-- Tiempo de generación: 21-02-2023 a las 14:54:58
-- Versión del servidor: 5.7.32
-- Versión de PHP: 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `s022045b_Gestion_Aguas`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `abonados`
--

CREATE TABLE `abonados` (
  `NIF` varchar(9) COLLATE latin1_spanish_ci NOT NULL,
  `Nombre` varchar(50) COLLATE latin1_spanish_ci NOT NULL,
  `Apellido1` varchar(50) COLLATE latin1_spanish_ci NOT NULL,
  `Apellido2` varchar(50) COLLATE latin1_spanish_ci NOT NULL,
  `Direccion` varchar(255) COLLATE latin1_spanish_ci NOT NULL,
  `Email` varchar(255) COLLATE latin1_spanish_ci NOT NULL,
  `Telefono` varchar(9) COLLATE latin1_spanish_ci NOT NULL,
  `Iban` varchar(24) COLLATE latin1_spanish_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_spanish_ci;

--
-- Volcado de datos para la tabla `abonados`
--

INSERT INTO `abonados` (`NIF`, `Nombre`, `Apellido1`, `Apellido2`, `Direccion`, `Email`, `Telefono`, `Iban`) VALUES
('11828614J', 'Fernando', 'Alonso', 'Carrera', 'Pl. Trigo, 8, 09400 Aranda de Duero, Burgos, EspaÃ±a', 's022045b_rodriguez@informaticasc.com', '689111111', 'ES1111111111111111111111'),
('11828615Z', 'JosÃ© Antonio', 'RodrÃ­guez', 'LÃ³pez', 'C. Burgo de Osma, 3D, 09400 Aranda de Duero, Burgos, EspaÃ±a', 's022045b_rodriguez1@informaticasc.com', '999999999', 'ES2222222222222222222222'),
('11828616S', 'Pedro', 'Duque', 'Astronauta', 'C. Isilla, 13, 09400 Aranda de Duero, Burgos, EspaÃ±a', 's022045b_rodriguez2@informaticasc.com', '666666666', 'ES2222222222222222212222'),
('11828617Q', 'Pedro', 'Sanchez', 'Arnaiz', 'C. Hospicio, 2, 09400 Aranda de Duero, Burgos, EspaÃ±a', 'j062667@gmail.com', '633333333', 'ES6666666666666666666666');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `consumos`
--

CREATE TABLE `consumos` (
  `IdDispositivo` int(11) NOT NULL,
  `Fecha_medida` date NOT NULL,
  `Medida` decimal(10,2) NOT NULL,
  `Precio` decimal(6,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_spanish_ci;

--
-- Volcado de datos para la tabla `consumos`
--

INSERT INTO `consumos` (`IdDispositivo`, `Fecha_medida`, `Medida`, `Precio`) VALUES
(11, '2023-03-30', 15.03, 3.50),
(11, '2023-06-30', 16.00, 3.50),
(11, '2023-09-30', 16.63, 3.50),
(11, '2023-12-30', 17.61, 3.50),
(11, '2024-03-30', 18.45, 3.50),
(11, '2024-06-30', 19.33, 3.50),
(11, '2024-09-30', 20.28, 3.50),
(11, '2024-12-30', 21.43, 3.50),
(11, '2025-03-30', 22.22, 3.50),
(11, '2025-06-30', 23.15, 3.50),
(11, '2025-09-30', 24.19, 3.50),
(11, '2025-12-30', 24.89, 3.50),
(11, '2026-03-30', 25.58, 3.50),
(11, '2026-06-30', 26.36, 3.50),
(11, '2026-09-30', 27.34, 3.50),
(11, '2026-12-30', 28.28, 3.50),
(12, '2023-03-30', 16.21, 3.50),
(12, '2023-06-30', 16.97, 3.50),
(12, '2023-09-30', 17.92, 3.50),
(12, '2023-12-30', 18.84, 3.50),
(12, '2024-03-30', 19.86, 3.50),
(12, '2024-06-30', 20.78, 3.50),
(12, '2024-09-30', 21.60, 3.50),
(12, '2024-12-30', 22.27, 3.50),
(12, '2025-03-30', 23.23, 3.50),
(12, '2025-06-30', 24.07, 3.50),
(12, '2025-09-30', 25.09, 3.50),
(12, '2025-12-30', 26.21, 3.50),
(12, '2026-03-30', 27.07, 3.50),
(12, '2026-06-30', 28.17, 3.50),
(12, '2026-09-30', 29.03, 3.50),
(12, '2026-12-30', 29.98, 3.50),
(13, '2023-03-30', 15.28, 3.50),
(13, '2023-06-30', 16.17, 3.50),
(13, '2023-09-30', 17.00, 3.50),
(13, '2023-12-30', 18.12, 3.50),
(13, '2024-03-30', 18.97, 3.50),
(13, '2024-06-30', 19.85, 3.50),
(13, '2024-09-30', 20.79, 3.50),
(13, '2024-12-30', 21.80, 3.50),
(13, '2025-03-30', 22.89, 3.50),
(13, '2025-06-30', 23.79, 3.50),
(13, '2025-09-30', 24.66, 3.50),
(13, '2025-12-30', 25.78, 3.50),
(13, '2026-03-30', 26.76, 3.50),
(13, '2026-06-30', 27.53, 3.50),
(13, '2026-09-30', 28.35, 3.50),
(13, '2026-12-30', 29.17, 3.50),
(14, '2023-03-30', 15.81, 3.50),
(14, '2023-06-30', 16.79, 3.50),
(14, '2023-09-30', 17.58, 3.50),
(14, '2023-12-30', 18.47, 3.50),
(14, '2024-03-30', 19.46, 3.50),
(14, '2024-06-30', 20.23, 3.50),
(14, '2024-09-30', 21.15, 3.50),
(14, '2024-12-30', 21.95, 3.50),
(14, '2025-03-30', 22.82, 3.50),
(14, '2025-06-30', 23.91, 3.50),
(14, '2025-09-30', 24.71, 3.50),
(14, '2025-12-30', 25.60, 3.50),
(14, '2026-03-30', 26.40, 3.50),
(14, '2026-06-30', 27.33, 3.50),
(14, '2026-09-30', 28.15, 3.50),
(14, '2026-12-30', 28.96, 3.50),
(15, '2023-03-30', 15.85, 3.50),
(15, '2023-06-30', 16.62, 3.50),
(15, '2023-09-30', 17.31, 3.50),
(15, '2023-12-30', 18.35, 3.50),
(15, '2024-03-30', 19.00, 3.50),
(15, '2024-06-30', 19.83, 3.50),
(15, '2024-09-30', 20.66, 3.50),
(15, '2024-12-30', 21.33, 3.50),
(15, '2025-03-30', 22.07, 3.50),
(15, '2025-06-30', 23.01, 3.50),
(15, '2025-09-30', 24.01, 3.50),
(15, '2025-12-30', 24.84, 3.50),
(15, '2026-03-30', 25.59, 3.50),
(15, '2026-06-30', 26.34, 3.50),
(15, '2026-09-30', 27.19, 3.50),
(15, '2026-12-30', 27.95, 3.50),
(16, '2023-03-30', 15.00, 3.50),
(16, '2023-06-30', 16.07, 3.50),
(16, '2023-09-30', 16.86, 3.50),
(16, '2023-12-30', 17.69, 3.50),
(16, '2024-03-30', 18.70, 3.50),
(16, '2024-06-30', 19.87, 3.50),
(16, '2024-09-30', 20.63, 3.50),
(16, '2024-12-30', 21.56, 3.50),
(16, '2025-03-30', 22.42, 3.50),
(16, '2025-06-30', 23.26, 3.50),
(16, '2025-09-30', 24.20, 3.50),
(16, '2025-12-30', 25.21, 3.50),
(16, '2026-03-30', 26.21, 3.50),
(16, '2026-06-30', 27.37, 3.50),
(16, '2026-09-30', 28.33, 3.50),
(16, '2026-12-30', 29.19, 3.50),
(17, '2023-03-30', 14.65, 3.50),
(17, '2023-06-30', 15.33, 3.50),
(17, '2023-09-30', 16.14, 3.50),
(17, '2023-12-30', 17.12, 3.50),
(17, '2024-03-30', 18.06, 3.50),
(17, '2024-06-30', 19.03, 3.50),
(17, '2024-09-30', 20.00, 3.50),
(17, '2024-12-30', 20.65, 3.50),
(17, '2025-03-30', 21.74, 3.50),
(17, '2025-06-30', 22.60, 3.50),
(17, '2025-09-30', 23.52, 3.50),
(17, '2025-12-30', 24.41, 3.50),
(17, '2026-03-30', 25.39, 3.50),
(17, '2026-06-30', 26.15, 3.50),
(17, '2026-09-30', 27.09, 3.50),
(17, '2026-12-30', 28.05, 3.50),
(18, '2023-03-30', 15.39, 3.50),
(18, '2023-06-30', 16.06, 3.50),
(18, '2023-09-30', 16.70, 3.50),
(18, '2023-12-30', 17.42, 3.50),
(18, '2024-03-30', 18.21, 3.50),
(18, '2024-06-30', 19.30, 3.50),
(18, '2024-09-30', 20.00, 3.50),
(18, '2024-12-30', 20.95, 3.50),
(18, '2025-03-30', 21.73, 3.50),
(18, '2025-06-30', 22.62, 3.50),
(18, '2025-09-30', 23.62, 3.50),
(18, '2025-12-30', 24.52, 3.50),
(18, '2026-03-30', 25.18, 3.50),
(18, '2026-06-30', 26.01, 3.50),
(18, '2026-09-30', 26.92, 3.50),
(18, '2026-12-30', 27.64, 3.50),
(19, '2023-03-30', 16.00, 3.50),
(19, '2023-06-30', 16.85, 3.50),
(19, '2023-09-30', 17.66, 3.50),
(19, '2023-12-30', 18.69, 3.50),
(19, '2024-03-30', 20.15, 3.50),
(19, '2024-06-30', 20.99, 3.50),
(19, '2024-09-30', 22.07, 3.50),
(19, '2024-12-30', 22.80, 3.50),
(19, '2025-03-30', 23.73, 3.50),
(19, '2025-06-30', 24.77, 3.50),
(19, '2025-09-30', 25.63, 3.50),
(19, '2025-12-30', 26.57, 3.50),
(19, '2026-03-30', 27.58, 3.50),
(19, '2026-06-30', 28.47, 3.50),
(19, '2026-09-30', 29.35, 3.50),
(19, '2026-12-30', 30.32, 3.50),
(20, '2023-03-30', 15.92, 3.50),
(20, '2023-06-30', 16.77, 3.50),
(20, '2023-09-30', 17.62, 3.50),
(20, '2023-12-30', 18.46, 3.50),
(20, '2024-03-30', 19.23, 3.50),
(20, '2024-06-30', 20.06, 3.50),
(20, '2024-09-30', 20.90, 3.50),
(20, '2024-12-30', 21.73, 3.50),
(20, '2025-03-30', 22.61, 3.50),
(20, '2025-06-30', 23.53, 3.50),
(20, '2025-09-30', 24.60, 3.50),
(20, '2025-12-30', 25.45, 3.50),
(20, '2026-03-30', 26.47, 3.50),
(20, '2026-06-30', 27.55, 3.50),
(20, '2026-09-30', 28.49, 3.50),
(20, '2026-12-30', 29.51, 3.50),
(21, '2023-03-30', 14.92, 3.50),
(21, '2023-06-30', 15.51, 3.50),
(21, '2023-09-30', 16.36, 3.50),
(21, '2023-12-30', 17.24, 3.50),
(21, '2024-03-30', 18.14, 3.50),
(21, '2024-06-30', 18.99, 3.50),
(21, '2024-09-30', 19.86, 3.50),
(21, '2024-12-30', 20.57, 3.50),
(21, '2025-03-30', 21.54, 3.50),
(21, '2025-06-30', 22.47, 3.50),
(21, '2025-09-30', 23.37, 3.50),
(21, '2025-12-30', 24.46, 3.50),
(21, '2026-03-30', 25.49, 3.50),
(21, '2026-06-30', 26.30, 3.50),
(21, '2026-09-30', 27.01, 3.50),
(21, '2026-12-30', 27.85, 3.50);

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `dispositivos`
--

CREATE TABLE `dispositivos` (
  `Id` int(11) NOT NULL,
  `NIF` varchar(9) COLLATE latin1_spanish_ci DEFAULT NULL,
  `Puesta_servicio` date NOT NULL,
  `Latitud` varchar(20) COLLATE latin1_spanish_ci NOT NULL,
  `Longitud` varchar(20) COLLATE latin1_spanish_ci NOT NULL,
  `Direccion` varchar(255) COLLATE latin1_spanish_ci NOT NULL,
  `Medida` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_spanish_ci;

--
-- Volcado de datos para la tabla `dispositivos`
--

INSERT INTO `dispositivos` (`Id`, `NIF`, `Puesta_servicio`, `Latitud`, `Longitud`, `Direccion`, `Medida`) VALUES
(11, '11828614J', '2023-02-20', '41.669406141888715', '-3.6917857984630187', 'Av. Ruperta Baraya, 14, 09400 Aranda de Duero, Burgos, EspaÃ±a', 28.70),
(12, '11828616S', '2023-02-20', '41.67053039770113', '-3.68919662857333', 'Pl. Mayor, 25, 09400 Aranda de Duero, Burgos, EspaÃ±a', 30.28),
(13, '11828614J', '2023-02-20', '41.666808181834575', '-3.698931370916756', 'Variante I N-I, 1, 09400 Aranda de Duero, Burgos, EspaÃ±a', 29.72),
(14, '11828617Q', '2023-02-11', '41.66820622947431', '-3.692071956637295', 'C. Santo Domingo, 2, 09400 Aranda de Duero, Burgos, EspaÃ±a', 29.50),
(15, '11828616S', '2023-02-19', '41.67350503044752', '-3.6788003948299886', 'Cam. Alagunas, 4, 09400 Aranda de Duero, Burgos, EspaÃ±a', 28.38),
(16, '11828615Z', '2023-02-20', '41.66126219407801', '-3.697652209774307', 'M862 GW Aranda de Duero, EspaÃ±a', 29.55),
(17, '11828615Z', '2023-02-11', '41.67150249500401', '-3.675863351673827', 'C. FernÃ¡n GonzÃ¡lez, 30, 09400 Aranda de Duero, Burgos, EspaÃ±a', 28.47),
(18, '11828617Q', '2023-02-20', '41.672560204539586', '-3.6820579861372327', 'C. Vela Zanetti, 8, 09400 Aranda de Duero, Burgos, EspaÃ±a', 28.06),
(19, '11828615Z', '2023-02-09', '41.665550291903415', '-3.6956892855635126', 'Calle Mz M6, 2, 09400 Aranda de Duero, Burgos, EspaÃ±a', 30.85),
(20, '11828615Z', '2023-02-11', '41.66630819155316', '-3.695596414076372', 'Manzana M5, 4, 09400 Aranda de Duero, Burgos, EspaÃ±a', 29.78),
(21, '11828616S', '2023-02-20', '41.66439605213706', '-3.6878036785625135', 'C. Burgo de Osma, 72, 09400 Aranda de Duero, Burgos, EspaÃ±a', 28.34);

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `abonados`
--
ALTER TABLE `abonados`
  ADD PRIMARY KEY (`NIF`);

--
-- Indices de la tabla `consumos`
--
ALTER TABLE `consumos`
  ADD PRIMARY KEY (`IdDispositivo`,`Fecha_medida`);

--
-- Indices de la tabla `dispositivos`
--
ALTER TABLE `dispositivos`
  ADD PRIMARY KEY (`Id`),
  ADD KEY `fk_nif` (`NIF`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `dispositivos`
--
ALTER TABLE `dispositivos`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- Restricciones para tablas volcadas
--

--
-- Filtros para la tabla `consumos`
--
ALTER TABLE `consumos`
  ADD CONSTRAINT `fk_id_dispositivo` FOREIGN KEY (`IdDispositivo`) REFERENCES `dispositivos` (`Id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Filtros para la tabla `dispositivos`
--
ALTER TABLE `dispositivos`
  ADD CONSTRAINT `fk_nif` FOREIGN KEY (`NIF`) REFERENCES `abonados` (`NIF`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
